{
  "09032025-Claude_x_Darwinex_Outlier.html": "Insurance sector analysis for people whose risk management strategy is 'hope and pray'.",
  "09052025-Claude_x_Darwinex_Outlier.html": "Insurance company metrics that make AIG executives look like conservative risk managers.",
  "09122025-Claude_x_Darwinex_Outlier.html": "Financial company research for investors whose money laundering knowledge is purely theoretical.",
  "09092025-Claude_x_Darwinex_Outlier.html": "Banking analysis for people who confuse 'mortgage backed securities' with home improvement loans.",
  "09112025-Claude_x_Darwinex_Outlier.html": "Banking market research for those who think 'derivatives' are what you get from calculus class.",
  "09092025-C.html": "Banking sector evaluation proving your fintech picks are as revolutionary as digital pet rocks.",
  "09102025-Active_Positions.html": "Active trading analysis for people who think 'backtesting' means testing how far back their losses go.",
  "09012025-Claude_x_Darwinex_Outlier.html": "Banking sector research for those who confuse 'liquid assets' with their drinking problem.",
  "09022025-Claude_x_Darwinex_Outlier.html": "Financial services evaluation proving your investment banking knowledge comes from Wolf of Wall Street.",
  "09082025-SRPT.html": "Biotechnology reports for people whose idea of diversification is losing money in multiple drug trials simultaneously.",
  "09042025-Claude_x_Darwinex_Outlier.html": "Insurance sector analysis that makes Bernie Madoff look like a legitimate financial advisor.",
  "09092025-Active_Positions.html": "Trading signals for degenerates who confuse backtested results on demo accounts with actual profitability.",
  "09102025-Claude_x_Darwinex_Outlier.html": "Financial services breakdown proving your fintech investments have the innovation of a rotary phone.",
  "09082025-Claude_x_Darwinex_Outlier.html": "Financial company research for investors whose money laundering knowledge is purely theoretical.",
  "gpu-buyers-guide-2025.html": "Hardware analysis for degenerates who confuse graphics cards with investment vehicles. Your wallet's funeral service."
}