{
  "09032025-Claude_x_Darwinex_Outlier.html": "Banking analysis for people who confuse 'mortgage backed securities' with home improvement loans.",
  "what-is-value-at-risk-var.html": "VaR methodology guide for masochists who enjoy quantifying exactly how much they can lose in precise percentiles.",
  "09052025-Claude_x_Darwinex_Outlier.html": "Insurance company metrics that make AIG executives look like conservative risk managers.",
  "understanding-iqr-analysis.html": "Outlier detection tutorials for those who think removing extreme observations removes extreme losses.",
  "09122025-Claude_x_Darwinex_Outlier.html": "Financial company assessment that demonstrates your bank picks have less security than a screen door.",
  "what-is-darwinex.html": "Risk engine education for those who think automated risk management eliminates the need for personal judgment.",
  "09092025-Claude_x_Darwinex_Outlier.html": "Banking sector research for those who confuse 'liquid assets' with their drinking problem.",
  "09112025-Claude_x_Darwinex_Outlier.html": "Financial sector analysis for people who think 'compound interest' is what banks charge for complicated questions.",
  "09092025-C.html": "Financial services breakdown for those whose credit union investments are union with poverty.",
  "09102025-Active_Positions.html": "Trading recommendations for signal sheep whose market analysis consists of waiting for uncle ICT's next tweet.",
  "what-is-enterprise-value-ev.html": "EV calculation guide for investors whose fundamental analysis produces consistently wrong conclusions.",
  "var-rubber-band-effect-darwinex.html": "Platform exploitation education for people who think arbitraging risk calculations is a sustainable business model.",
  "09012025-Claude_x_Darwinex_Outlier.html": "Banking evaluation for investors whose credit score has more stability than their stock picks.",
  "09022025-Claude_x_Darwinex_Outlier.html": "Financial services evaluation proving your investment banking knowledge comes from Wolf of Wall Street.",
  "09082025-SRPT.html": "Biotech analysis for those who think playing roulette with regulatory approval is a sound investment thesis.",
  "09042025-Claude_x_Darwinex_Outlier.html": "Insurance sector analysis that makes Bernie Madoff look like a legitimate financial advisor.",
  "proactive-risk-management-vs-fixed-lot-size.html": "Financial company research for investors whose money laundering knowledge is purely theoretical.",
  "09092025-Active_Positions.html": "Trading analysis for signal followers whose market timing has the accuracy of a broken stopwatch.",
  "09102025-Claude_x_Darwinex_Outlier.html": "Financial sector deep-dive for investors whose portfolio diversification resembles a Ponzi scheme.",
  "09082025-Claude_x_Darwinex_Outlier.html": "Insurance sector analysis for people whose risk management strategy is 'hope and pray'.",
  "what-is-average-true-range-atr.html": "Volatility measurement education for chaos addicts who mistake market turbulence for trading opportunities.",
  "gpu-buyers-guide-2025.html": "Hardware analysis for degenerates who confuse graphics cards with investment vehicles. Your wallet's funeral service."
}