{
  "09102025-Active_Positions.html": "Trading thesis for ICT disciples whose understanding of market manipulation comes from YouTube conspiracy videos.",
  "what-is-value-at-risk-var.html": "VaR methodology guide for masochists who enjoy quantifying exactly how much they can lose in precise percentiles.",
  "09092025-Claude_x_Darwinex_Outlier.html": "Financial services evaluation proving your investment banking knowledge comes from Wolf of Wall Street.",
  "gpu-buyers-guide-2025.html": "Hardware analysis for degenerates who confuse graphics cards with investment vehicles. Your wallet's funeral service.",
  "09042025-Claude_x_Darwinex_Outlier.html": "Financial services breakdown proving your fintech investments have the innovation of a rotary phone.",
  "09092025-Active_Positions.html": "Position management for fake guru disciples who believe 'market structure' is a mystical concept worth $5000 courses.",
  "09082025-SRPT.html": "Pharmaceutical sector breakdown for those who think 'peer review' means asking their dealer for investment advice.",
  "09032025-Claude_x_Darwinex_Outlier.html": "Insurance company metrics that make AIG executives look like conservative risk managers.",
  "what-is-darwinex.html": "Algorithmic asset management education for people whose trading automation automates their losses more efficiently.",
  "09102025-Claude_x_Darwinex_Outlier.html": "Insurance sector analysis that makes Bernie Madoff look like a legitimate financial advisor.",
  "09092025-C.html": "Financial company research for investors whose money laundering knowledge is purely theoretical.",
  "what-is-average-true-range-atr.html": "Volatility measurement education for chaos addicts who mistake market turbulence for trading opportunities.",
  "09082025-Claude_x_Darwinex_Outlier.html": "Insurance sector analysis for people whose risk management strategy is 'hope and pray'.",
  "09122025-Claude_x_Darwinex_Outlier.html": "Financial services breakdown for those whose credit union investments are union with poverty.",
  "understanding-iqr-analysis.html": "Statistical analysis education for data miners who think robust statistics can make unreliable data reliable.",
  "09012025-Claude_x_Darwinex_Outlier.html": "Banking analysis for people who confuse 'mortgage backed securities' with home improvement loans.",
  "09112025-Claude_x_Darwinex_Outlier.html": "Financial sector analysis for people who think 'compound interest' is what banks charge for complicated questions.",
  "what-is-enterprise-value-ev.html": "EV calculation guide for investors whose fundamental analysis produces consistently wrong conclusions.",
  "var-rubber-band-effect-darwinex.html": "Banking sector research for those who confuse 'liquid assets' with their drinking problem.",
  "09022025-Claude_x_Darwinex_Outlier.html": "Banking evaluation for investors whose credit score has more stability than their stock picks.",
  "09052025-Claude_x_Darwinex_Outlier.html": "Banking sector evaluation proving your fintech picks are as revolutionary as digital pet rocks."
}