{
  "09032025-Claude_x_Darwinex_Outlier.html": "Financial services evaluation proving your investment banking knowledge comes from Wolf of Wall Street.",
  "what-is-value-at-risk-var.html": "Risk management education for people who think confidence intervals provide actual confidence about their finances.",
  "09052025-Claude_x_Darwinex_Outlier.html": "Financial sector deep-dive for investors whose portfolio diversification resembles a Ponzi scheme.",
  "understanding-iqr-analysis.html": "Interquartile range tutorials for outlier hunters whose data cleaning resembles financial money laundering.",
  "09122025-Claude_x_Darwinex_Outlier.html": "Insurance sector analysis that makes Bernie Madoff look like a legitimate financial advisor.",
  "what-is-darwinex.html": "Trading platform guide for signal chasers who confuse technological sophistication with investment returns.",
  "09092025-Claude_x_Darwinex_Outlier.html": "Financial sector analysis for people who think 'compound interest' is what banks charge for complicated questions.",
  "09112025-Claude_x_Darwinex_Outlier.html": "Banking evaluation for investors whose credit score has more stability than their stock picks.",
  "09092025-C.html": "Financial company research for investors whose money laundering knowledge is purely theoretical.",
  "09102025-Active_Positions.html": "Trading opportunities for fake guru victims whose financial advisor is a YouTube algorithm.",
  "what-is-enterprise-value-ev.html": "EV calculation guide for investors whose fundamental analysis produces consistently wrong conclusions.",
  "var-rubber-band-effect-darwinex.html": "VaR gaming strategies for algorithmic wannabes whose understanding of rubber band effects exceeds their trading ability.",
  "09012025-Claude_x_Darwinex_Outlier.html": "Banking market research for those who think 'derivatives' are what you get from calculus class.",
  "09022025-Claude_x_Darwinex_Outlier.html": "Financial services breakdown proving your fintech investments have the innovation of a rotary phone.",
  "09082025-SRPT.html": "Gene therapy analysis for people whose biotech investments require more miracles than Lourdes.",
  "09042025-Claude_x_Darwinex_Outlier.html": "Banking analysis for people who confuse 'mortgage backed securities' with home improvement loans.",
  "proactive-risk-management-vs-fixed-lot-size.html": "Banking sector research for those who confuse 'liquid assets' with their drinking problem.",
  "09092025-Active_Positions.html": "Investment signals for people who think 'order flow' is the queue at their local unemployment office.",
  "09102025-Claude_x_Darwinex_Outlier.html": "Financial company assessment that demonstrates your bank picks have less security than a screen door.",
  "09082025-Claude_x_Darwinex_Outlier.html": "Insurance company metrics that make AIG executives look like conservative risk managers.",
  "what-is-average-true-range-atr.html": "Technical analysis education for traders whose risk management involves more hope than mathematics.",
  "gpu-buyers-guide-2025.html": "Hardware analysis for degenerates who confuse graphics cards with investment vehicles. Your wallet's funeral service."
}